A nice thing about the "`enabled` should be just like commenting the thing out" approach is that we can already rehearse what that would be like with today's Terraform, so let's do that.

Here's my starting configuration:

```hcl

terraform {
  required_providers {
    aws = {
      source = "hashicorp/aws"
    }
  }
}

provider "aws" {
  region = "us-west-2"
}

resource "aws_vpc" "example" {
  cidr_block = "10.0.0.0/16"
}

output "vpc_id" {
  value = aws_vpc.example.id
}
```

This initial configuration has an unconditional `aws_vpc` resource, and I can plan it:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_vpc.example will be created
  + resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_id = (known after apply)
```

If we had `enabled` as a feature then maybe we'd make the decision about whether to manage the VPC dynamic like this:

```hcl

variable "manage_vpc" {
  type    = bool
  default = true
}

terraform {
  required_providers {
    aws = {
      source = "hashicorp/aws"
    }
  }
}

provider "aws" {
  region = "us-west-2"
}

resource "aws_vpc" "example" {
  enabled = var.manage_vpc

  cidr_block = "10.0.0.0/16"
}

output "vpc_id" {
  value = aws_vpc.example.id
}
```

With today's Terraform I'll simulate "`enabled = false is just like commenting it out" by actually commenting it out:

```hcl

terraform {
  required_providers {
    aws = {
      source = "hashicorp/aws"
    }
  }
}

provider "aws" {
  region = "us-west-2"
}

/*
resource "aws_vpc" "example" {
  cidr_block = "10.0.0.0/16"
}
*/

output "vpc_id" {
  value = aws_vpc.example.id
}
```

But now my configuration is invalid:

```
╷
│ Error: Reference to undeclared resource
│ 
│   on simulate-enabled.tf line 21, in output "vpc_id":
│   21:   value = aws_vpc.example.id
│ 
│ A managed resource "aws_vpc" "example" has not been declared in the root module.
╵
```

The only way I can now make this valid is to also remove the `output "vpc_id"` block, and therefore never export the VPC ID _even when it's enabled_, because there's no way to make a dynamic decision based on whether it's enabled or not -- it doesn't exist at all in the case where it's disabled.

Is this really what those of you who are asking for it to behave like commented out mean, or am I misunderstanding?
